sdaiInsertNestedAggrAfter(Sdai_ItrId*)
\details
Inserts a new nested aggregate value into an application instance list after the element referenced by a specified iterator.
\param iterator [in] An iterator object that refers to the element to insert the new value.
\returns The inserted aggregate value.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NRW - SDAI-model access is not read-write.
* sdaiAI_NEXS - Aggregate instance does not exist.
* sdaiAI_NVLD - Aggregate instance invalid.
* sdaiIR_NEXS - Iterator does not exist.
* sdaiIR_NSET - Iterator not set.
* sdaiVA_NSET - Value not set.
* sdaiEX_NSUP - Expression evaluation not supported.
* sdaiSY_ERR - Underlying system error.